Before you turn this problem in, make sure everything runs as expected.

1. When connecting to the database, replace *yasiro01* or *username* with **your** username
1. Delete the `# YOUR CODE HERE` or `YOUR ANSWER HERE` line and replace it with your specific answer
1. Delete `raise NotImplementedError()`, if present
1. Include `%%sql` cell magic directive at the beginning of each cell with a SQL statement
1. **Restart the kernel** (in the menubar, select Kernel$\rightarrow$Restart)
1. **Run all cells** (in the menubar, select Cell$\rightarrow$Run All)
1. Add your name and collaborators below:

In [10]:
NAME = "Frank Lugola"
COLLABORATORS = ""

---

# More Practice with Movies

In this assignment we introduce a third table in the movie database, the release_date table. Thus in the postgresql database we now have three tables:

* moviecast
* title
* release_date

The tables have the following schema:

```
 Table "public.title"
 Column |  Type  | Modifiers 
--------+--------+-----------
 index  | bigint | 
 title  | text   | 
 year   | bigint | 


  Table "public.moviecast"
  Column   |       Type       | Modifiers 
-----------+------------------+-----------
 index     | bigint           | 
 title     | text             | 
 year      | bigint           | 
 name      | text             | 
 type      | text             | 
 character | text             | 
 n         | double precision | 



 Table "public.release_date"
 Column  |  Type  | Modifiers 
---------+--------+-----------
 index   | bigint | 
 title   | text   | 
 year    | bigint | 
 country | text   | 
 date    | date   | 
 month   | bigint |
 day     | bigint |
 dow     | bigint |
```


### Hints

* Warning, some of these queries can create very large cartesian products! You may want to use query to help reduce the size of both relations.
* The ``njoin`` operator is more efficient with memory than cartesian product. You should prefer njoin where you can.

In [11]:
from reframe import Relation
import warnings
warnings.filterwarnings('ignore')
from sols5 import *

moviecast = Relation('/home/LC/yasiro01/pub/cast.csv',sep=',')
title = Relation('/home/LC/yasiro01/pub/titles.csv',sep=',')
release_date = Relation('/home/LC/yasiro01/pub/release_dates.csv',sep=',')

In [12]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [14]:
%sql postgresql://yasiro01:@localhost/movies

'Connected: yasiro01@movies'

## 1.  How many movies were released in each country in the year 2017?

Your result should be a table that contains columns *country* and *releases*, sorted by the country name.

In [15]:
release_date.query('year==2017').groupby(['country']).count('title').sort(['country']).rename('count_title','releases')

                 country  releases
0              Argentina        11
1              Australia        16
2                Austria         8
3                Bahamas         1
4                Belgium        12
5                 Brazil        21
6                 Canada        19
7                  Chile         1
8                  China         1
9               Colombia         5
10        Czech Republic         2
11               Denmark         8
12               Estonia         3
13               Finland         3
14                France        18
15               Germany        23
16                Greece         1
17               Hungary         1
18                 India         1
19             Indonesia         1
20                  Iran         1
21               Ireland         3
22                 Italy         5
23               Jamaica         1
24                 Japan         5
25                Latvia         1
26              Malaysia         1
27                Mexico        10
28           Netherlands        37
29           New Zealand         6
30                Norway        12
31           Philippines         2
32                Poland         6
33              Portugal         9
34               Romania         3
35                Russia        11
36                Serbia         1
37             Singapore         1
38              Slovakia         1
39                 Spain         5
40                Sweden        27
41              Thailand         1
42                Turkey        17
43                    UK        54
44                   USA       253
45               Ukraine         6
46  United Arab Emirates         1
47               Uruguay         1
48               Vietnam         1
49              Zimbabwe         1

In [16]:
sol_cp1r(release_date,moviecast,_)

Correct!

You got 2 out of 2 points.

In [32]:
%%sql
select country, count(title) as releases
from title natural join release_date
where year=2017
group by country
order by country;

 * postgresql://yasiro01:***@localhost/movies
50 rows affected.

[('Argentina', 11),
 ('Australia', 16),
 ('Austria', 8),
 ('Bahamas', 1),
 ('Belgium', 12),
 ('Brazil', 21),
 ('Canada', 19),
 ('Chile', 1),
 ('China', 1),
 ('Colombia', 5),
 ('Czech Republic', 2),
 ('Denmark', 8),
 ('Estonia', 3),
 ('Finland', 3),
 ('France', 18),
 ('Germany', 23),
 ('Greece', 1),
 ('Hungary', 1),
 ('India', 1),
 ('Indonesia', 1),
 ('Iran', 1),
 ('Ireland', 3),
 ('Italy', 5),
 ('Jamaica', 1),
 ('Japan', 5),
 ('Latvia', 1),
 ('Malaysia', 1),
 ('Mexico', 10),
 ('Netherlands', 37),
 ('New Zealand', 6),
 ('Norway', 12),
 ('Philippines', 2),
 ('Poland', 6),
 ('Portugal', 9),
 ('Romania', 3),
 ('Russia', 11),
 ('Serbia', 1),
 ('Singapore', 1),
 ('Slovakia', 1),
 ('Spain', 5),
 ('Sweden', 27),
 ('Thailand', 1),
 ('Turkey', 17),
 ('UK', 54),
 ('Ukraine', 6),
 ('United Arab Emirates', 1),
 ('Uruguay', 1),
 ('USA', 253),
 ('Vietnam', 1),
 ('Zimbabwe', 1)]

In [33]:
sol_cp1s(_)

Correct!

You got 2 out of 2 points.

## 2.  Show all of the countries in alphabetical order that released a movie starring Tom Cruise between 1980 and 1985 (inclusive).

Your answer should be a single column with the names of the countries. The country names should not be duplicated.

In [18]:
release_date.query('year>= 1980 & year <=1985').njoin(moviecast).query("name =='Tom Cruise'").\
project(['country']).sort(['country'])

             country
133043     Argentina
21124      Australia
133391        Brazil
256044        Canada
133101       Denmark
133507       Finland
132869        France
504240     Hong Kong
358848       Ireland
133333         Japan
132985   Netherlands
427285        Norway
245615        Poland
133565      Portugal
132927   South Korea
133275         Spain
133217        Sweden
133159            UK
21084            USA
359056       Uruguay
133449  West Germany

In [19]:
sol_cp2r(release_date,moviecast,_)

Correct!

You got 2 out of 2 points.

In [41]:
%%sql
Select distinct country
from release_date NATURAL JOIN moviecast
WHERE name='Tom Cruise'

AND year>=1980 AND year<=1985
GROUP BY country
ORDER BY country ASC;

 * postgresql://yasiro01:***@localhost/movies
21 rows affected.

[('Argentina',),
 ('Australia',),
 ('Brazil',),
 ('Canada',),
 ('Denmark',),
 ('Finland',),
 ('France',),
 ('Hong Kong',),
 ('Ireland',),
 ('Japan',),
 ('Netherlands',),
 ('Norway',),
 ('Poland',),
 ('Portugal',),
 ('South Korea',),
 ('Spain',),
 ('Sweden',),
 ('UK',),
 ('Uruguay',),
 ('USA',),
 ('West Germany',)]

In [42]:
sol_cp2s(_)

Correct!

You got 2 out of 2 points.

## 3.  Show the name of the lead actor/actress and title of the movie where the movie was released on a Monday in the USA during 2017.

Hint: Assume Sunday is day 0.

In [54]:
moviecast.query('n==1').njoin(release_date.query('dow==1 & year== 2017 &country=="USA"')).project(['name','title'])

               name                 title
0      Lilly Dennis  Flirting and Hurting
1  Katharyn R. King                 Apart

In [55]:
sol_cp3r(release_date,moviecast,_)

Correct!

You got 2 out of 2 points.

In [52]:
%%sql
select name,title
from release_date natural join moviecast
where n=1 and dow=1 and year=2017 and country='USA'

 * postgresql://yasiro01:***@localhost/movies
2 rows affected.

[('Lilly Dennis', 'Flirting and Hurting'), ('Katharyn R. King', 'Apart')]

In [53]:
sol_cp3s(_)

Correct!

You got 2 out of 2 points.

## 4. Show names of top 3 lead actresses that have starred in the most movies released during the summer season in Ukraine since 2000 (inclusive).

Let us define the **summer season** as the months of June, July and August.

Sort the results by the number of title and then name of an actress in descending order.

Hint: Assume January is month 1.

In [36]:
moviecast.head(2)

                      title  year        name     type         character    n
0  Star Trek: First Contact  1996  Joey Anaya    actor              Borg  NaN
1              Apache Trail  1942  Donna Reed  actress  Rosalia Martinez  2.0

In [37]:
release_date.head(2)

                           title  year country        date  month  day  dow
0          #73, Shaanthi Nivaasa  2007   India  2007-06-15      6   15    4
1  #AnonOccupy: Bio of a Villain  2015     USA  2015-11-05     11    5    3

In [58]:
moviecast.query('n==1 & type=="actress"').njoin(release_date.query('month>=6 & month<=8 & year>= 2000 & country="Ukraine"')).\

groupby('name').count('title').sort(['name']),ascending=False).sort(['count_title']),ascending=False).head(3);

SyntaxError: invalid syntax (<ipython-input-58-620b36c8f2b3>, line 1)

SyntaxError: invalid syntax (<ipython-input-57-5f8d26682cb3>, line 1)

In [51]:
sol_cp4r(release_date,moviecast,_)

AttributeError: 'ResultSet' object has no attribute 'reset_index'

In [49]:
%%sql
select name,count(Distinct title)
from moviecast natural join release_date
where n=1 and type='actress' and month>=6 and month<=8 and year>=2000 and country='Ukraine'
group by name
order by count(distinct title) desc
limit 3;

 * postgresql://yasiro01:***@localhost/movies
3 rows affected.

[('Sandra Bullock', 3), ('Sarah Jessica Parker', 2), ('Cameron Diaz', 2)]

In [50]:
sol_cp4s(_)

Correct!

You got 2 out of 2 points.

## 5.  Show the titles of all of the movies that were released in France before they were released in Italy in the year 2017.

Hint: join the relation to itself to answer this question. Use the operation cartesian_product for the relational algebra query. Use renamed columns (ending with \_x and \_y) properly.

The result should include 1 column, *title*.

[SQL join a table to itself - w3resource](https://www.w3resource.com/sql/joins/join-a-table-to-itself.php)

In [22]:
release_date.head(2)

                           title  year country        date  month  day  dow
0          #73, Shaanthi Nivaasa  2007   India  2007-06-15      6   15    4
1  #AnonOccupy: Bio of a Villain  2015     USA  2015-11-05     11    5    3

In [26]:
release_date.query('year == 2017 & country=="France"').\
cartesian_product(release_date.query('year == 2017 & country == "Italy"')).\
query('date_x<date_y').query('title_x==title_y').rename('title_x','title').project(['title'])

           title
46  Paddington 2

In [27]:
sol_cp5r(release_date,moviecast,_)

Correct!

You got 2 out of 2 points.

In [30]:
%%sql
select x.title
from release_date as x, release_date y
where x.title=y.title and x.year=2017 and y.year=2017 and x.country='France' and y.country='Italy' and x.date<y.date

 * postgresql://yasiro01:***@localhost/movies
1 rows affected.

[('Paddington 2',)]

In [31]:
sol_cp5s(_)

Correct!

You got 2 out of 2 points.